eisup_2019_docmng_integration/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ВидПодразделения</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЯвляетсяДирекцией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЯвляетсяДепартаментом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодИСУЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтноситсяКФинСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипПодразделенияОрганизации</name>
    <type>
      <types>EnumRef.абс_ТипыПодразделенийОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КатегорияПодразделения</name>
    <type>
      <types>EnumRef.абс_КатегорияПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Блок</name>
    <type>
      <types>CatalogRef.абс_Блоки</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалитьабс_Ответственные</name>
    <attributes>
      <name>ОтветственныйСотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИсторияЦФОЦФУпоПодразделению/абс_ИсторияЦФОЦФУпоПодразделению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИсторияЦФОЦФУпоПодразделению</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_ТипыПодразделенийОрганизации/абс_ТипыПодразделенийОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыПодразделенийОрганизации</name>
  <enumValues>
    <name>ЦФО</name>
  </enumValues>
  <enumValues>
    <name>МестоположениеОС</name>
  </enumValues>
  <enumValues>
    <name>ПодразделениеОрганизации</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыНСИ/абс_СтатусыНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыНСИ</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеКадровиком</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеИнформации</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ПодразделенияОрганизаций/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем КонтролироватьПорядок Экспорт;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура, обработчик события "ПередЗаписью" объекта
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекРодитель = Ссылка; 	
	Пока ЗначениеЗаполнено(ТекРодитель.Родитель) Цикл
		ТекРодитель = ТекРодитель.Родитель;
		Если не ТекРодитель.абс_ТипПодразделенияОрганизации = абс_ТипПодразделенияОрганизации Тогда
			Отказ = Истина;
			Сообщить("Элемент с типом «"+абс_ТипПодразделенияОрганизации+"» нельзя размещать в ветке, где родитель имеет тип «"+ТекРодитель.абс_ТипПодразделенияОрганизации+"», код родителя «"+СокрЛП(ТекРодитель.Код)+"»!");	
		КонецЕсли;
	КонецЦикла;	 		
	
	Если Ссылка.абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.ПодразделениеОрганизации Тогда
		Отказ = Истина;
		Сообщить("Изменение элементов с типа «подразделение организации» не доступно!") 
	КонецЕсли;

	Если НЕ ((РольДоступна("ПолныеПрава") 
			 	и (абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.ЦФО
			   		или абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.МестоположениеОС))
		      или (РольДоступна("абс_УчетОСиНМА") 
				и абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.МестоположениеОС)) Тогда
				
		Отказ = Истина;
		Сообщить("Ввод новых и изменение элементов не доступен!");	
		
	КонецЕсли;
	
	// АБС ВСТАВКА
	абс_Используется = НЕ (абс_Статус = Перечисления.абс_СтатусыНСИ.Архив);
	// АБС ВСТАВКА КОНЕЦ
	
	Если НЕ Отказ Тогда
		ОбщегоНазначения.ПередЗаписьюОбъектаПорядка(Отказ, ЭтотОбъект, КонтролироватьПорядок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//АБС_Стрельцов + НАЧАЛО
	//добавлено: 22.03.2013
	//-------------------------------
	Если ЭтотОбъект.абс_ЦФО <> Ссылка.абс_ЦФО или ЭтотОбъект.абс_ЦФУ <> Ссылка.абс_ЦФУ Тогда
		НЗ = РегистрыСведений.абс_ИсторияЦФОЦФУпоПодразделению.СоздатьМенеджерЗаписи();
		
		НЗ.Период = ТекущаяДата();
		НЗ.ПодразделениеОрганизации = Ссылка;
		НЗ.ЦФО = ЭтотОбъект.абс_ЦФО;
		НЗ.ЦФУ = ЭтотОбъект.абс_ЦФУ;
		НЗ.Пользователь = глЗначениеПеременной("глТекущийПользователь");
		НЗ.Записать(Истина);
	КонецЕсли;
	//----------------------------------
	//АБС_Стрельцов - КОНЕЦ
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = ТИп("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("абс_ТипПодразделенияОрганизации") Тогда
			абс_ТипПодразделенияОрганизации = ДанныеЗаполнения.абс_ТипПодразделенияОрганизации;
		Иначе
			абс_ТипПодразделенияОрганизации = Перечисления.абс_ТипыПодразделенийОрганизации.МестоположениеОС;
		КонецЕсли;			
			
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

КонтролироватьПорядок = Истина;

// АБС ВСТАВКА Фролов не нужно контролировать порядок
КонтролироватьПорядок = Ложь;
// АБС ВСТАВКА Фролов не нужно контролировать порядок КОНЕЦ
